In [1]:
# Import required librarriws
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
!ls

data
EDA-AVOCADO-BEHNAM.ipynb
README.md

In [3]:
#read the data 
db=pd.read_csv("./data/avocado.csv")
db.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [4]:
db.shape

(18249, 14)

In [5]:
db.size

255486

In [6]:
db.describe()

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,year
count,18249.000000,18249.000000,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,18249.000000,18249.000000
mean,24.232232,1.405978,8.506440e+05,2.930084e+05,2.951546e+05,2.283974e+04,2.396392e+05,1.821947e+05,5.433809e+04,3106.426507,2016.147899
std,15.481045,0.402677,3.453545e+06,1.264989e+06,1.204120e+06,1.074641e+05,9.862424e+05,7.461785e+05,2.439660e+05,17692.894652,0.939938
min,0.000000,0.440000,8.456000e+01,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000,2015.000000
25%,10.000000,1.100000,1.083858e+04,8.540700e+02,3.008780e+03,0.000000e+00,5.088640e+03,2.849420e+03,1.274700e+02,0.000000,2015.000000
50%,24.000000,1.370000,1.073768e+05,8.645300e+03,2.906102e+04,1.849900e+02,3.974383e+04,2.636282e+04,2.647710e+03,0.000000,2016.000000
75%,38.000000,1.660000,4.329623e+05,1.110202e+05,1.502069e+05,6.243420e+03,1.107834e+05,8.333767e+04,2.202925e+04,132.500000,2017.000000
max,52.000000,3.250000,6.250565e+07,2.274362e+07,2.047057e+07,2.546439e+06,1.937313e+07,1.338459e+07,5.719097e+06,551693.650000,2018.000000

In [7]:
db.info()
# unnamed should be deleted

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 14 columns):
Unnamed: 0      18249 non-null int64
Date            18249 non-null object
AveragePrice    18249 non-null float64
Total Volume    18249 non-null float64
4046            18249 non-null float64
4225            18249 non-null float64
4770            18249 non-null float64
Total Bags      18249 non-null float64
Small Bags      18249 non-null float64
Large Bags      18249 non-null float64
XLarge Bags     18249 non-null float64
type            18249 non-null object
year            18249 non-null int64
region          18249 non-null object
dtypes: float64(9), int64(2), object(3)
memory usage: 1.9+ MB

In [8]:
db.dtypes
# all integer and float
# excpet : Date (should chnage to date /time ------region as string  categorical----type as string (categorical))

Unnamed: 0        int64
Date             object
AveragePrice    float64
Total Volume    float64
4046            float64
4225            float64
4770            float64
Total Bags      float64
Small Bags      float64
Large Bags      float64
XLarge Bags     float64
type             object
year              int64
region           object
dtype: object

In [9]:
db.isnull().any().any()
# there is no null value

False

In [10]:
db.year.unique()

array([2015, 2016, 2017, 2018], dtype=int64)

In [11]:
db.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

In [14]:
# region is mix of state , city and divison .for comparison it needs to be seperated.also it has total U.S.
# I looked up this on Hass website, and it seems that they divided us in  some division  :california, west, south central
#south east,mid south, great lakes and north east .
# each divison  cover some city (maybe distrubution center or ...)
# also there is one region as total U.S.
np.count_nonzero(db.region.unique())

54

In [19]:
db.region.value_counts()
# report is for eaxh state

Detroit                338
GreatLakes             338
SanDiego               338
HartfordSpringfield    338
Charlotte              338
Sacramento             338
Spokane                338
West                   338
Albany                 338
BuffaloRochester       338
Boise                  338
Southeast              338
Atlanta                338
Chicago                338
Orlando                338
PhoenixTucson          338
SouthCarolina          338
Roanoke                338
RichmondNorfolk        338
NorthernNewEngland     338
Philadelphia           338
SanFrancisco           338
Pittsburgh             338
NewYork                338
Nashville              338
GrandRapids            338
Indianapolis           338
Boston                 338
CincinnatiDayton       338
Seattle                338
Jacksonville           338
Denver                 338
SouthCentral           338
DallasFtWorth          338
Midsouth               338
California             338
Portland               338
LosAngeles             338
StLouis                338
Syracuse               338
LasVegas               338
Columbus               338
Houston                338
RaleighGreensboro      338
NewOrleansMobile       338
HarrisburgScranton     338
TotalUS                338
Plains                 338
MiamiFtLauderdale      338
Tampa                  338
Louisville             338
Northeast              338
BaltimoreWashington    338
WestTexNewMexico       335
Name: region, dtype: int64

In [15]:
# What is unnamed columns for ? I thought it is region code  . but it is not . 
db["Unnamed: 0"].value_counts()

7     432
11    432
1     432
2     432
3     432
4     432
5     432
6     432
8     432
9     432
10    432
0     432
43    324
18    324
20    324
14    324
35    324
19    324
30    324
50    324
34    324
46    324
27    324
49    324
33    324
17    324
15    324
48    324
32    324
16    324
36    324
45    324
21    324
24    324
12    324
42    324
26    324
28    324
41    324
25    324
44    324
40    324
13    324
39    324
23    324
31    324
38    324
22    324
29    324
37    324
47    324
51    322
52    107
Name: Unnamed: 0, dtype: int64

In [21]:
db[db["Unnamed: 0"]==7]

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
7,7,2015-11-08,0.98,109428.33,703.75,101815.36,80.00,6829.22,6266.85,562.37,0.00,conventional,2015,Albany
59,7,2015-11-08,1.12,334041.60,250441.38,34483.33,488.24,48628.65,35662.93,12941.12,24.60,conventional,2015,Atlanta
111,7,2015-11-08,1.05,830967.23,58579.27,576512.71,51035.04,144840.21,138777.63,6062.58,0.00,conventional,2015,BaltimoreWashington
163,7,2015-11-08,1.11,55847.79,31910.27,4651.88,6285.73,12999.91,12777.83,119.79,102.29,conventional,2015,Boise
215,7,2015-11-08,1.04,641759.57,5304.09,542880.92,231.74,93342.82,88265.25,5077.57,0.00,conventional,2015,Boston
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18196,7,2018-02-04,1.22,6294.16,85.22,152.09,0.00,6056.85,2847.48,3209.37,0.00,organic,2018,Syracuse
18208,7,2018-02-04,1.32,7363.56,89.59,440.31,0.00,6833.66,6827.78,5.88,0.00,organic,2018,Tampa
18220,7,2018-02-04,1.53,1384683.41,117922.52,287724.61,1703.52,977084.84,774695.74,201878.69,510.41,organic,2018,TotalUS
18232,7,2018-02-04,1.41,283378.47,22474.66,55360.49,133.41,205409.91,70232.59,134666.91,510.41,organic,2018,West
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.00,organic,2018,WestTexNewMexico

In [22]:
db.year.value_counts()
# it is 4 years

2017    5722
2016    5616
2015    5615
2018    1296
Name: year, dtype: int64

In [23]:
#convert date to datetime format 
# it seems it is  weekly report
pd.to_datetime(db.Date)

0       2015-12-27
1       2015-12-20
2       2015-12-13
3       2015-12-06
4       2015-11-29
           ...
18244   2018-02-04
18245   2018-01-28
18246   2018-01-21
18247   2018-01-14
18248   2018-01-07
Name: Date, Length: 18249, dtype: datetime64[ns]

In [24]:
db.columns
# check the columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [25]:
#remove not needed column 
del db["Unnamed: 0"]

In [26]:
# set index ad date 
db.set_index(db.Date,inplace=True)
pd.to_datetime(db.index)

DatetimeIndex(['2015-12-27', '2015-12-20', '2015-12-13', '2015-12-06',
               '2015-11-29', '2015-11-22', '2015-11-15', '2015-11-08',
               '2015-11-01', '2015-10-25',
               ...
               '2018-03-11', '2018-03-04', '2018-02-25', '2018-02-18',
               '2018-02-11', '2018-02-04', '2018-01-28', '2018-01-21',
               '2018-01-14', '2018-01-07'],
              dtype='datetime64[ns]', name='Date', length=18249, freq=None)

In [27]:
# remove date as column.I could not do it when I set index .it  did not work.
del db["Date"]

In [28]:
db.head()

,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
Date,,,,,,,,,,,,
2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [29]:
(db['4046']+db['4225']+db['4770']==db['Total Volume']).sum()
# only in 10  record sum of Avocado sales equals to 3 labels.probably there should be more avocado brand
#

10

In [30]:
(db['Small Bags']+db['Large Bags']+db['XLarge Bags']==db['Total Bags']).sum()
# for 14000 record total bags wulas to small+large +x large 
# for about 4000 record it dose not match.maybe there is another way to seel the avocado

14213

In [33]:
(db['4046']+db['4225']+db['4770']+db['Total Bags']==db['Total Volume']).sum()

12879

In [51]:
# for 4036  record the sum dose not work .
check_bags=db[(db['Small Bags']+db['Large Bags']+db['XLarge Bags']!=db['Total Bags'])].copy()

In [52]:
check_bags.count()

AveragePrice    4036
Total Volume    4036
4046            4036
4225            4036
4770            4036
Total Bags      4036
Small Bags      4036
Large Bags      4036
XLarge Bags     4036
type            4036
year            4036
region          4036
dtype: int64

In [56]:
# we have 2 type of Avovado oragnic and conventional/ and we have 3 code avocado information.
db.type.unique()

array(['conventional', 'organic'], dtype=object)

In [57]:
db.type.value_counts()

conventional    9126
organic         9123
Name: type, dtype: int64

In [55]:
db_conventional=db.loc[db.type=='conventional'].copy()
db_organic=db.loc[db.type=='organic'].copy()

In [59]:
db.head()

,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
Date,,,,,,,,,,,,
2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [71]:
# if we have a column with avocado type (4046,4225,4770) and then amount sold  , it was easier to aggregate
# same as having the column bag type (small, Large, X large)

In [ ]:
question :
    compare total volume in different cities in U.S
    Compare ave. price in different state in U.S.
    relation between ave, price and demand ?